In [5]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import random

In [24]:
Operator= "+"
columns = ["First_figure", "Operator", "Second_figure", "Result"]
df_addition = pd.DataFrame(columns=columns)

for i in range(200):
    First_figure = np.random.randint(1, 30)
    Operator = Operator
    Second_figure = np.random.randint(1, 20)
    Result = First_figure + Second_figure
    df_addition.loc[i] = [First_figure, Operator, Second_figure, Result]

In [25]:
df_addition.duplicated().sum()

25

In [37]:
subtractor = "-"
columns = ["First_figure", "Operator", "Second_figure", "Result"]
df_subtractor = pd.DataFrame(columns=columns)

for i in range(200):
    First_figure = np.random.randint(1, 30)
    Operator = subtractor
    Second_figure = np.random.randint(1, 20)
    Result = First_figure - Second_figure
    df_subtractor.loc[i] = [First_figure, Operator, Second_figure, Result]
    
df_subtractor.head()

  First_figure Operator Second_figure Result
0           12        -             5      7
1           15        -            13      2
2           24        -             3     21
3           10        -            15     -5
4           28        -             1     27

In [30]:
df_subtractor.duplicated().sum()

25

In [31]:
multiplier = "*"
columns = ["First_figure", "Operator", "Second_figure", "Result"]
df_multiplier = pd.DataFrame(columns = columns)

for i in range(200):
    First_figure = np.random.randint(1, 30)
    Operator = multiplier
    Second_figure = np.random.randint(1, 20)
    Result = First_figure * Second_figure
    df_multiplier.loc[i] = [First_figure, Operator, Second_figure, Result]
    
df_multiplier.head()

  First_figure Operator Second_figure Result
0           26        *            13    338
1            9        *             3     27
2           17        *            14    238
3           19        *             9    171
4            6        *            14     84

In [32]:
df_multiplier.duplicated().sum()

37

In [33]:
divider = "/"
columns = ["First_figure", "Operator", "Second_figure", "Result"]
df_division = pd.DataFrame(columns = columns)

for i in range(200):
    First_figure = np.random.randint(1, 30)
    Operator = divider
    Second_figure = np.random.randint(1, 20)
    Result = First_figure / Second_figure
    df_division.loc[i] = [First_figure, Operator, Second_figure, Result]
    
df_division.head()

  First_figure Operator Second_figure  Result
0           14        /            16  0.8750
1           15        /            15  1.0000
2            2        /             5  0.4000
3           13        /            10  1.3000
4           13        /            16  0.8125

In [34]:
df_division.duplicated().sum()

40

In [43]:
data = pd.concat([df_addition, df_division, df_multiplier, df_subtractor])
data.head()

  First_figure Operator Second_figure Result
0            7        +             7     14
1           13        +            14     27
2           26        +             6     32
3            6        +             2      8
4           19        +             5     24

In [46]:
from sklearn.utils import shuffle
datasets = shuffle(data)

In [47]:
datasets.head()

    First_figure Operator Second_figure    Result
123           20        +             8        28
143           10        /            12  0.833333
138           20        +            10        30
97             6        +            17        23
11            17        -            14         3

In [51]:
datasets.to_csv("Larger_dataset.csv", index =False)

In [49]:
datasets.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 800 entries, 123 to 39
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   First_figure   800 non-null    object
 1   Operator       800 non-null    object
 2   Second_figure  800 non-null    object
 3   Result         800 non-null    object
dtypes: object(4)
memory usage: 31.2+ KB